KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_СпецификацияКДоговору/КАНАТ_СпецификацияКДоговору.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_СпецификацияКДоговору</name>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_НомерИДатаДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ФИОСопроводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_АвтомобильМарка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ПримечаниеКСпецификацииДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ДоставкаСпецификацияКДоговору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ПлатитЗаДоставку</name>
    <type>
      <types>EnumRef.КАНАТ_ПлатитЗаДоставку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3404cb9a-92ea-42b9-9086-ad481dbc27d7">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ХранилищеИтоговыйТекст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ПоСоглашению</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d4de0c91-22dd-4ce4-bc98-884061653165">
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9b99d944-1b87-423e-a8a0-f6748f86530b">
    <name>НаименованиеДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f56e0158-d692-474d-bb59-3cb9fe0131ae">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec175e6e-8a0f-46c1-8f61-1933ed068350">
    <name>ДоговорСУчастникомГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2821c1b-dcf2-47d6-9871-b26fe7c33e1f">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a00d91d9-5c1d-491a-b338-92dc631c1afd">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ba089968-9caa-4200-9002-b8f3267b4b61">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6fe24eab-4e23-451e-8cae-c25d6e78e3df">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КАНАТ_БлокиДоговора</name>
    <attributes>
      <name>БлокДоговора</name>
      <type>
        <types>CatalogRef.КАНАТ_БлокиДоговоров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_СпецификацияКДоговору/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказКлиента.Номер КАК Номер,
			|	ЗаказКлиента.Контрагент КАК Контрагент,
			|	ЗаказКлиента.КАНАТ_ПлатитЗаДоставку КАК КАНАТ_ПлатитЗаДоставку,
			|	ЗаказКлиента.КАНАТ_ЯвляетсяСпецификацией КАК КАНАТ_ЯвляетсяСпецификацией,
			|	ЗаказКлиента.КАНАТ_СпецификацияНомер КАК КАНАТ_СпецификацияНомер,
			|	ЗаказКлиента.КАНАТ_ДатаСпецификации КАК КАНАТ_ДатаСпецификации,
			|	ЗаказКлиента.КАНАТ_НомерИДатаДоверенности КАК КАНАТ_НомерИДатаДоверенности,
			|	ЗаказКлиента.КАНАТ_ФИОСопроводителя КАК КАНАТ_ФИОСопроводителя,
			|	ЗаказКлиента.КАНАТ_Водитель КАК КАНАТ_Водитель,
			|	ЗаказКлиента.КАНАТ_ГосНомер КАК КАНАТ_ГосНомер,
			|	ЗаказКлиента.КАНАТ_АвтомобильМарка КАК КАНАТ_АвтомобильМарка,
			|	ЗаказКлиента.АдресДоставки КАК АдресДоставки,
			|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
			|	ЗаказКлиента.Соглашение КАК Соглашение,
			|	ЗаказКлиента.Договор КАК Договор
			|ИЗ
			|	Документ.ЗаказКлиента КАК ЗаказКлиента
			|ГДЕ
			|	ЗаказКлиента.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
			|	ЗаказКлиентаТовары.Количество КАК Количество,
			|	ЗаказКлиентаТовары.Сумма КАК СуммаБезНДС,
			|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
			|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
			|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
			|	ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
			|	ЗаказКлиентаТовары.Цена КАК Цена
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|ГДЕ
			|	ЗаказКлиентаТовары.Ссылка = &Ссылка
			//БИТ_Гурьев__06.05.24++
			|	И ЗаказКлиентаТовары.Отменено = Ложь
			//БИТ_Гурьев__06.05.24--
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	КАНАТ_СпецификацияКДоговору.ПорядковыйНомер КАК ПорядковыйНомер
			|ИЗ
			|	Документ.КАНАТ_СпецификацияКДоговору КАК КАНАТ_СпецификацияКДоговору
			|ГДЕ
			|	КАНАТ_СпецификацияКДоговору.Договор = &Договор
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПорядковыйНомер УБЫВ";
		
		Запрос.УстановитьПараметр("Ссылка",  ДокументОснование);
		Запрос.УстановитьПараметр("Договор", ДокументОснование.Договор);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ДанныеСпецификации = РезультатЗапроса[0].Выгрузить();
		
		Если ДанныеСпецификации.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеСпецификации[0]);
		КонецЕсли;
		
		ВыборкаТовары = РезультатЗапроса[1].Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл
			
			Строка = Товары.Добавить();
			
			ЗаполнитьЗначенияСвойств(Строка, ВыборкаТовары);
			
		КонецЦикла;
		
		КоличествоСпецификаций = РезультатЗапроса[2].Выгрузить();
		Если КоличествоСпецификаций.Количество() > 0 Тогда
			
			ПорядковыйНомер = КоличествоСпецификаций[0].ПорядковыйНомер + 1;
			
		Иначе
			
			ПорядковыйНомер = 1;
			
		КонецЕсли;
		
		Номер = СтрШаблон("%1-%2", Номер, Формат(ПорядковыйНомер,"ЧЦ=2; ЧВН="));
		
		КАНАТ_ДоставкаСпецификацияКДоговору = СтрШаблон("Способ отгрузки: %1 за счет %2%3Грузополучатель: %4",
														СпособДоставки,
														КАНАТ_ПлатитЗаДоставку,
														Символы.ПС,
														АдресДоставки);
		КАНАТ_ПримечаниеКСпецификацииДоговора = "Условия оплаты: по договору.
												|*Количество с учетом особенностей канатно-веревочной подукции приведено ориентировочное
												|
												|**Цены на продукцию указаны без НДС и без учета стоимости транспортных затрат, по состоянию на дату спецификации и могут изменяться в зависимости от изменения цен на сырье, электроэнергию, энергоносители и т.д. Цены на каждую поставку корректируются согласно пункта 3.3. настоящего договора.";
		
		//БИТ_Шамсиев++ 09.10.2024 2. При создании Спецификации к договору должна быть проверка 
		//на наличие договора (если договор не создан, то документ спецификации создать нельзя и пользователю выдается ошибка)
		Если не ЗначениеЗаполнено(Договор) тогда  
			ВызватьИсключение "Не указан договор!"; 
		КонецЕсли;	
		//БИТ_Шамсиев-- 09.10.2024 2. При создании Спецификации к договору должна быть проверка 
		//на наличие договора (если договор не создан, то документ спецификации создать нельзя и пользователю выдается ошибка)
	КонецЕсли;
	
КонецПроцедуры
 Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() ИЛИ Договор.Статус <> Перечисления.СтатусыДоговоровКонтрагентов.Действует ТОгда
		ОбщегоНазначения.СообщитьПользователю("Не выбран действующий договор",,"Договор",,Отказ);
	КонецЕсли;
	
КонецПроцедуры
